CF/Documents/ПриказНаПроведениеИнвентаризацииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриказНаПроведениеИнвентаризацииТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтбораТоваровИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОтбораТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриказовНаПроведениеИнвентаризацийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/CommonModules/КорректировкаОстатковЕГАИСКлиентПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// В процедуре требуется реализовать открытие формы нового документа пересчета товаров.
//
// Параметры:
//  Форма - УправляемаяФорма - форма запущенной обработки корректировки остатков,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - организация предприятия,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - магазин, в котором корректируются остатки.
//
Процедура СоздатьПриказНаПроведениеИнвентаризации(Форма, Организация, ТорговыйОбъект) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Магазин", ТорговыйОбъект);
	Отбор.Вставить("Организация", Организация);
	Отбор.Вставить("ПравилаОтбораТоваровИнвентаризации", ПредопределенноеЗначение("Справочник.ПравилаОтбораТоваров.ИнвентаризацияАлкогольнойПродукции"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Отбор);
	
	ОткрытьФорму("Документ.ПриказНаПроведениеИнвентаризацииТоваров.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

// В процедуре требуется реализовать открытие формы списка документов пересчета товаров.
//
// Параметры:
//  Форма - УправляемаяФорма - форма запущенной обработки корректировки остатков,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - организация предприятия,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - магазин, в котором корректируются остатки.
//
Процедура ОткрытьСписокИнвентаризаций(Форма, Организация, ТорговыйОбъект) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Магазин", ТорговыйОбъект);
	Отбор.Вставить("Организация", Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ПриказНаПроведениеИнвентаризацииТоваров.ФормаСписка", ПараметрыФормы, Форма);
	
КонецПроцедуры

// Формирует отчет по излишкам/недостачам для переданного торгового объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - форма запущенной обработки корректировки остатков,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - магазин, в котором корректируются остатки.
//
Процедура СформироватьОтчетПоИзлишкамНедостачам(Форма, ТорговыйОбъект) Экспорт
	
	ПараметрыФормы = Новый Структура(
		"Отбор, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии",
		Новый Структура("Склад", ИнтеграцияЕГАИСРТВызовСервера.ПолучитьСкладыМагазина(ТорговыйОбъект)),
		"ОформлениеИзлишковНедостачКонтекст",
		"ОформлениеИзлишковНедостачКонтекст",
		Истина);
	
	ОткрытьФорму("Отчет.ОформлениеИзлишковНедостачТоваров.Форма",
				ПараметрыФормы,
				Форма,
				Форма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
